# Время выполнить задание
#
# Скачайте любой датасет с сайта https://www.kaggle.com/datasets
# Загрузите набор данных из CSV-файла в DataFrame.
# Выведите первые 5 строк данных, чтобы получить представление о структуре данных.
# Выведите информацию о данных (.info()) и статистическое описание (.describe()).
# Определите среднюю зарплату (Salary) по городу (City) - используйте файл приложенный к дз - dz.csv
#

import pandas as pd

df = pd.read_csv("sun.csv") # открываем csv файл
print(df.head(5)) # выводим первые 5 строк
print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
print(df.info()) # выводим информацию
print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
print(df.describe()) # выводим описательную статистику
print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")

df = pd.read_csv("dz.csv") # открываем csv файл
print(df)
gr = df.groupby("City")["Salary"].mean()
print(gr)
